Revit 2027 API
CableTrayType.IsWithFitting Property
 Whether this cable tray type is with fitting
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWithFitting { get; }
Public ReadOnly Property IsWithFitting As Boolean
	Get
public:
property bool IsWithFitting {
	bool get ();
}
member IsWithFitting : bool with get
Property Value
Boolean
Remarks
 True if this cable tray type is with fitting type.
See Also
Reference
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace